Revit 2026 API

# PerformanceAdviserRuleId Operators

---

The PerformanceAdviserRuleId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equality(PerformanceAdviserRuleId, PerformanceAdviserRuleId) | Compares two PerformanceAdviserRuleId instances. |
|  | Inequality(PerformanceAdviserRuleId, PerformanceAdviserRuleId) | Compares two PerformanceAdviserRuleId instances. |

#### Reference

PerformanceAdviserRuleId Class

Autodesk.Revit.DB Namespace